<!-- placeholder-1 -->
```fish
terraform plan -chdir=. -refresh=true
```
<!-- placeholder-2 -->

<details open><summary>Diff of 7 changes.</summary>

```diff
+ tailscale_tailnet_key.tailscale_key will be created
! module.debian13.proxmox_virtual_environment_vm.vm will be updated in-place
+ module.debian13.time_static.creation_date will be created
! module.ubuntu22.proxmox_virtual_environment_vm.vm will be updated in-place
+ module.ubuntu22.time_static.creation_date will be created
! module.vm_minimal_config.proxmox_virtual_environment_vm.vm will be updated in-place
+ module.vm_minimal_config.time_static.creation_date will be created
```
</details>
<!-- placeholder-3 -->
<details><summary>Plan: 4 to add, 3 to change, 0 to destroy.</br>

<!-- placeholder-4 -->
###### By @b- at 2025-08-16T22:56:14Z [(view log)](https://github.com/perchnet/p/actions/runs/17013803366/job/48233286945#step:11:1).
</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # tailscale_tailnet_key.tailscale_key will be created
  + resource "tailscale_tailnet_key" "tailscale_key" {
      + created_at    = (known after apply)
      + ephemeral     = false
      + expires_at    = (known after apply)
      + expiry        = 600
      + id            = (known after apply)
      + invalid       = (known after apply)
      + key           = (sensitive value)
      + preauthorized = true
      + reusable      = true
      + tags          = [
          + "tag:web-ingress",
        ]
      + user_id       = (known after apply)
    }

  # module.debian13.proxmox_virtual_environment_vm.vm will be updated in-place
  ~ resource "proxmox_virtual_environment_vm" "vm" {
      + boot_order              = [
          + "scsi0",
        ]
      ~ description             = "Terraform VM created on 2025-08-15T02:28:26Z" -> (known after apply)
        id                      = "9013"
        name                    = "debian13"
      ~ tablet_device           = true -> false
        tags                    = [
            "debian",
            "template",
            "terraform",
        ]
        # (27 unchanged attributes hidden)

      + operating_system {
          + type = "l26"
        }

        # (8 unchanged blocks hidden)
    }

  # module.debian13.time_static.creation_date will be created
  + resource "time_static" "creation_date" {
      + day     = (known after apply)
      + hour    = (known after apply)
      + id      = (known after apply)
      + minute  = (known after apply)
      + month   = (known after apply)
      + rfc3339 = (known after apply)
      + second  = (known after apply)
      + unix    = (known after apply)
      + year    = (known after apply)
    }

  # module.ubuntu22.proxmox_virtual_environment_vm.vm will be updated in-place
  ~ resource "proxmox_virtual_environment_vm" "vm" {
      + boot_order              = [
          + "scsi0",
        ]
      ~ description             = "Terraform VM created on 2025-08-15T02:28:28Z" -> (known after apply)
        id                      = "8022"
        name                    = "ubuntu22"
      ~ tablet_device           = true -> false
        tags                    = [
            "template",
            "terraform",
            "ubuntu",
        ]
        # (27 unchanged attributes hidden)

      + operating_system {
          + type = "l26"
        }

        # (7 unchanged blocks hidden)
    }

  # module.ubuntu22.time_static.creation_date will be created
  + resource "time_static" "creation_date" {
      + day     = (known after apply)
      + hour    = (known after apply)
      + id      = (known after apply)
      + minute  = (known after apply)
      + month   = (known after apply)
      + rfc3339 = (known after apply)
      + second  = (known after apply)
      + unix    = (known after apply)
      + year    = (known after apply)
    }

  # module.vm_minimal_config.proxmox_virtual_environment_vm.vm will be updated in-place
  ~ resource "proxmox_virtual_environment_vm" "vm" {
      ~ description             = "Terraform VM created on 2025-08-16T06:33:08Z" -> (known after apply)
        id                      = "134"
        name                    = "vm-debian13-minimal"
      ~ tablet_device           = true -> false
        tags                    = [
            "terraform",
        ]
        # (27 unchanged attributes hidden)

      ~ disk {
          ~ cache             = "none" -> "writeback"
          ~ discard           = "ignore" -> "on"
          ~ iothread          = false -> true
            # (12 unchanged attributes hidden)
        }
      + disk {
          + aio          = "io_uring"
          + backup       = true
          + cache        = "writeback"
          + datastore_id = "zssd"
          + discard      = "on"
          + file_format  = "raw"
          + interface    = "scsi1"
          + iothread     = true
          + replicate    = true
          + size         = 11
          + ssd          = false
        }

      + operating_system {
          + type = "l26"
        }

        # (8 unchanged blocks hidden)
    }

  # module.vm_minimal_config.time_static.creation_date will be created
  + resource "time_static" "creation_date" {
      + day     = (known after apply)
      + hour    = (known after apply)
      + id      = (known after apply)
      + minute  = (known after apply)
      + month   = (known after apply)
      + rfc3339 = (known after apply)
      + second  = (known after apply)
      + unix    = (known after apply)
      + year    = (known after apply)
    }

Plan: 4 to add, 3 to change, 0 to destroy.
```
</details>
<!-- placeholder-5 -->
<!-- terraform-62-3eee8c84341b95e00d4d4dd1307a8268.tfplan -->
<!-- placeholder-6 -->